Функция docs_dltGET(Запрос)

	//#Если Не ВебКлиент Тогда
	//	ИмяАлгоритма	= "HTTPCервис_RESTData_docs_dltGET";
	//	ТекстАлгоритма	= глПолучитьТекстАлгоритма(ИмяАлгоритма);
	//	Если НЕ ПустаяСтрока(ТекстАлгоритма) Тогда
	//		ПродолжитьВыполнение			= Ложь;
	//		РезультатВыполненияАлгоритма	= Неопределено;
	//		Попытка
	//			Выполнить(ТекстАлгоритма);
	//		Исключение
	//			ТекстОшибки = "АЛГОРИТМ '" + ИмяАлгоритма + "':" + СтроковыеФункцииКлиентСервер.ПолучитьПредставлениеОшибки(ИнформацияОбОшибке());
	//			РегистрацияОшибок.ЗарегистрироватьОшибку(ТекстОшибки, "Критический");
	//			ВызватьИсключение(ТекстОшибки);
	//		КонецПопытки;
	//		Если Не ПродолжитьВыполнение Тогда
	//			Возврат РезультатВыполненияАлгоритма;
	//		КонецЕсли;
	//	КонецЕсли;
	//#КонецЕсли
	//
	/////////////////////////////////////////////////////////////////////
	
	ПараметрыURL		= Новый СписокЗначений;
	ПараметрыURL.Добавить("methodName");
	ПараметрыЗапроса	= Новый Структура;
	ПараметрыЗаголовок	= Новый СписокЗначений;
	
	Ответ = ms_РаботаСREST.ОбработатьЗапрос(Запрос, "docs_dltGET", ПараметрыЗаголовок, ПараметрыURL, ПараметрыЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция docs_dltDELETE(Запрос)
	
	#Если Не ВебКлиент Тогда
		ИмяАлгоритма	= "HTTPCервис_RESTData_docs_dltDELETE";
		ТекстАлгоритма	= глПолучитьТекстАлгоритма(ИмяАлгоритма);
		Если НЕ ПустаяСтрока(ТекстАлгоритма) Тогда
			ПродолжитьВыполнение			= Ложь;
			РезультатВыполненияАлгоритма	= Неопределено;
			Попытка
				Выполнить(ТекстАлгоритма);
			Исключение
				ТекстОшибки = "АЛГОРИТМ '" + ИмяАлгоритма + "':" + СтроковыеФункцииКлиентСервер.ПолучитьПредставлениеОшибки(ИнформацияОбОшибке());
				РегистрацияОшибок.ЗарегистрироватьОшибку(ТекстОшибки, "Критический");
				ВызватьИсключение(ТекстОшибки);
			КонецПопытки;
			Если Не ПродолжитьВыполнение Тогда
				Возврат РезультатВыполненияАлгоритма;
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
	///////////////////////////////////////////////////////////////////
	
	ПараметрыURL 		= Новый СписокЗначений;
	ПараметрыURL.Добавить("methodName");
	ПараметрыЗапроса 	= Новый СписокЗначений;
	ПараметрыЗаголовок 	= Новый СписокЗначений;
	
	Ответ = RestDataСервер.ОбработатьЗапрос(Запрос, "docs_dltDELETE", ПараметрыЗаголовок, ПараметрыURL, ПараметрыЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция docs_dltPOST(Запрос)

	#Если Не ВебКлиент Тогда
		ИмяАлгоритма	= "HTTPCервис_RESTData_docs_dltPOST";
		ТекстАлгоритма	= глПолучитьТекстАлгоритма(ИмяАлгоритма);
		Если НЕ ПустаяСтрока(ТекстАлгоритма) Тогда
			ПродолжитьВыполнение			= Ложь;
			РезультатВыполненияАлгоритма	= Неопределено;
			Попытка
				Выполнить(ТекстАлгоритма);
			Исключение
				ТекстОшибки = "АЛГОРИТМ '" + ИмяАлгоритма + "':" + СтроковыеФункцииКлиентСервер.ПолучитьПредставлениеОшибки(ИнформацияОбОшибке());
				РегистрацияОшибок.ЗарегистрироватьОшибку(ТекстОшибки, "Критический");
				ВызватьИсключение(ТекстОшибки);
			КонецПопытки;
			Если Не ПродолжитьВыполнение Тогда
				Возврат РезультатВыполненияАлгоритма;
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
	///////////////////////////////////////////////////////////////////
	
	ПараметрыURL		= Новый СписокЗначений;
	ПараметрыURL.Добавить("methodName");
	ПараметрыЗапроса	= Новый Структура;
	ПараметрыЗаголовок	= Новый СписокЗначений;
	
	Ответ = RestDataСервер.ОбработатьЗапрос(Запрос, "docs_dltPOST", ПараметрыЗаголовок, ПараметрыURL, ПараметрыЗапроса);
	
	Возврат Ответ;
	
КонецФункции


Функция ОбработатьЗапрос(Запрос, ИмяМетода, ПараметрыЗаголовок, ПараметрыURL, ПараметрыЗапроса, ОтветВСтруктуру = Истина) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		АлгоритмВыполнен = ЛОЖЬ; РезультатВыполненияАлгоритма = Неопределено;
		Выполнить(АлгоритмыКлиентСервер.ТекстАлгоритмаЗамены("ОМ_RESTDataСервер_ОбработатьЗапрос"));
		Если АлгоритмВыполнен = ИСТИНА Тогда Возврат РезультатВыполненияАлгоритма; КонецЕсли; 
	#КонецЕсли 
	
	///////////////////////////////////////////////////////////////////
	
	// ++ Улюшев М.С. 2022.05.24 PRAARC-6916
	ДанныеОВремениВыполнения = ОценкаПроизводительностиОпераций.ПолучитьСтруктуруЗамераДлительности(Истина); // Время выполнения
	// -- Улюшев М.С. 2022.05.24 PRAARC-6916
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно",   			Истина);
	Результат.Вставить("КодОтвета", 			200);
	Результат.Вставить("Данные",    			Неопределено);
	Результат.Вставить("Заголовки",				Новый Соответствие);
	Результат.Вставить("Причина",   			"");
	Результат.Вставить("ПричинаДетально",   	"");
	Результат.Вставить("ПричинаДляПользователя","");
		
	Результат.Вставить("ОтветВСтруктуру",		ОтветВСтруктуру); //флаг разделяющий старый и новый формат ответа сервисов
	Результат.Вставить("ВнутреннийКод",	 		0);
	Результат.Вставить("ОшибочныеПараметры",  	Неопределено);
		
	СтруктураПараметров = ПолучитьПараметрыЗапроса(Результат, Запрос, ИмяМетода, ПараметрыЗаголовок, ПараметрыURL, ПараметрыЗапроса);
	
	// ++ Улюшев М.С. 2022.05.24 PRAARC-6916
	Если СтруктураПараметров = Неопределено Тогда
		НастройкиЗапроса 		  = ПолучитьСтруктуруНастроекДляЛогирования(Результат, Запрос, ИмяМетода, ПараметрыЗаголовок, ПараметрыURL, ПараметрыЗапроса);
		ИсходнаяСтруктураНастроек = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(НастройкиЗапроса);			
	Иначе
		ИсходнаяСтруктураНастроек = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураПараметров);			
	КонецЕсли;	
	
	Мета  		 		 	  = ИсходнаяСтруктураНастроек.ПараметрыОбработки.Метаданные;	
	ИмяОперации			 	  = "HTTP-сервис RESTData " + ИсходнаяСтруктураНастроек.ПараметрыОбработки.КлючОбработки;
	СтруктураДляХранилища	  = СформироватьСтруктуруДанныхДляХранилища(Запрос, ИсходнаяСтруктураНастроек);
	// ++ Улюшев М.С. 2022.05.24 PRAARC-6916
	
	Если Результат.Успешно = Ложь Тогда
		Ответ = HTTPОтвет(Результат);
		
		// ++ Улюшев М.С. 2022.05.24 PRAARC-6916
		ОценкаПроизводительностиОпераций.ЗафиксироватьЗамерДлительности(ДанныеОВремениВыполнения, "ДлительностьОбщая");

		ДозаполнитьСтруктуруДанныхОтветом(СтруктураДляХранилища, Ответ, Результат, ДанныеОВремениВыполнения); 
				
		Логирование.ДобавитьВЖурналДействий(Мета, ИмяОперации, , , 
						Новый Структура("ДлительностьОбщая,Дополнительно,СтруктураДляХранилищаЗначений,БылОтказ", 
								ДанныеОВремениВыполнения.ДлительностьОбщая, 
								ИсходнаяСтруктураНастроек.ПараметрыОбработки.МетодОбработки,
								ПолучитьИтоговуюСтруктуруДляЛогирования(СтруктураДляХранилища), Истина));
		// -- Улюшев М.С. 2022.05.24 PRAARC-6916
		
		Возврат Ответ;
	КонецЕсли;
	
	ВыполнитьОбработкуЗапроса(Результат, СтруктураПараметров);
		
	Если Результат.Успешно = Ложь Тогда
		Ответ = HTTPОтвет(Результат);
		
		// ++ Улюшев М.С. 2022.05.24 PRAARC-6916
		ОценкаПроизводительностиОпераций.ЗафиксироватьЗамерДлительности(ДанныеОВремениВыполнения, "ДлительностьОбщая");

		ДозаполнитьСтруктуруДанныхОтветом(СтруктураДляХранилища, Ответ, Результат, ДанныеОВремениВыполнения); 
				
		Логирование.ДобавитьВЖурналДействий(Мета, ИмяОперации, , , 
						Новый Структура("ДлительностьОбщая,Дополнительно,СтруктураДляХранилищаЗначений,БылОтказ", 
								ДанныеОВремениВыполнения.ДлительностьОбщая, 
								ИсходнаяСтруктураНастроек.ПараметрыОбработки.МетодОбработки,
								ПолучитьИтоговуюСтруктуруДляЛогирования(СтруктураДляХранилища), Истина));
		// -- Улюшев М.С. 2022.05.24 PRAARC-6916
		
		Возврат Ответ;
	КонецЕсли;
	
	Попытка
		
		Ответ = HTTPОтвет(Результат);
		
	Исключение
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПолучитьПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаполнитьРезультатОтветаСервиса(Результат, Ложь, 500,,, "Ошибка сбора ответного сообщения", ТекстОшибки, 8,,
		"Что-то пошло не так. Попробуйте  повторить позднее. Если ошибка возникнет еще раз, обратитесь в отдел технической поддержки. Текст ошибки: " + ТекстОшибки);
		
		Ответ = HTTPОтвет(Результат);
		
		// ++ Улюшев М.С. 2022.05.24 PRAARC-6916
		ОценкаПроизводительностиОпераций.ЗафиксироватьЗамерДлительности(ДанныеОВремениВыполнения, "ДлительностьОбщая");

		ДозаполнитьСтруктуруДанныхОтветом(СтруктураДляХранилища, Ответ, Результат, ДанныеОВремениВыполнения); 
				
		Логирование.ДобавитьВЖурналДействий(Мета, ИмяОперации, , , 
						Новый Структура("ДлительностьОбщая,Дополнительно,СтруктураДляХранилищаЗначений,БылОтказ", 
								ДанныеОВремениВыполнения.ДлительностьОбщая, 
								ИсходнаяСтруктураНастроек.ПараметрыОбработки.МетодОбработки,
								ПолучитьИтоговуюСтруктуруДляЛогирования(СтруктураДляХранилища), Истина));
		// -- Улюшев М.С. 2022.05.24 PRAARC-6916
		
		Возврат Ответ;
		
	КонецПопытки;
	          
	// ++ Улюшев М.С. 2022.05.24 PRAARC-6916
	ОценкаПроизводительностиОпераций.ЗафиксироватьЗамерДлительности(ДанныеОВремениВыполнения, "ДлительностьОбщая");
	
	ДозаполнитьСтруктуруДанныхОтветом(СтруктураДляХранилища, Ответ, Результат, ДанныеОВремениВыполнения); 
	
	Логирование.ДобавитьВЖурналДействий(Мета, ИмяОперации, , , 
											Новый Структура("ДлительностьОбщая,Дополнительно,СтруктураДляХранилищаЗначений,БылОтказ", 
											ДанныеОВремениВыполнения.ДлительностьОбщая, 
											ИсходнаяСтруктураНастроек.ПараметрыОбработки.МетодОбработки,
											ПолучитьИтоговуюСтруктуруДляЛогирования(СтруктураДляХранилища), ЛОЖЬ));
	// -- Улюшев М.С. 2022.05.24 PRAARC-6916

	Возврат Ответ;
	
КонецФункции
