
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФинансовыеПоказатели = ФинансовыеПоказатели();
	СтоимостьПортфеля = ФинансовыеПоказатели.СтоимостьОстаток;
	РеализованныйPnLЗаМесяц = ФинансовыеПоказатели.ПрибыльУбытокЗаМесяц;
	РеализованныйPnLСначалаГода = ФинансовыеПоказатели.ПрибыльУбытокСНачалаГода;
	НереализованныйPnL = ФинансовыеПоказатели.НереализованныйPnL;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьФинРез", 60, Истина);
	
КонецПроцедуры

&НаСервере
Функция ФинансовыеПоказатели()
	
	Результат = Новый Структура("СтоимостьОстаток, ПрибыльУбытокЗаМесяц, ПрибыльУбытокСНачалаГода, НереализованныйPnL");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПозицииИнструментовОстатки.СтоимостьОстаток КАК СтоимостьОстаток
		|ИЗ
		|	РегистрНакопления.ПозицииИнструментов.Остатки КАК ПозицииИнструментовОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФинансовыеРезультатыПоСделкамОбороты.ПрибыльУбытокОборот КАК ПрибыльУбытокОборот
		|ИЗ
		|	РегистрНакопления.ФинансовыеРезультатыПоСделкам.Обороты(&ДатаНачала, , Период, ) КАК ФинансовыеРезультатыПоСделкамОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФинансовыеРезультатыПоСделкамОбороты.ПрибыльУбытокОборот КАК ПрибыльУбытокОборот
		|ИЗ
		|	РегистрНакопления.ФинансовыеРезультатыПоСделкам.Обороты(&ДатаНачалаГода, , Период, ) КАК ФинансовыеРезультатыПоСделкамОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ПозицииИнструментовОстатки.КоличествоОстаток * ЕСТЬNULL(ТекущиеЦеныСрезПоследних.Цена, 0) - ПозицииИнструментовОстатки.СтоимостьОстаток) КАК НереализованныйPnL
		|ИЗ
		|	РегистрНакопления.ПозицииИнструментов.Остатки КАК ПозицииИнструментовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеЦены.СрезПоследних КАК ТекущиеЦеныСрезПоследних
		|		ПО ПозицииИнструментовОстатки.Инструмент = ТекущиеЦеныСрезПоследних.Инструмент";
	
	Запрос.Параметры.Вставить("ДатаНачала", ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
	Запрос.Параметры.Вставить("ДатаНачалаГода", НачалоГода(ТекущаяДатаСеанса()));
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка= РезультатЗапроса[0].Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.СтоимостьОстаток = Выборка.СтоимостьОстаток;
	КонецЕсли;
	
	Выборка= РезультатЗапроса[1].Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.ПрибыльУбытокЗаМесяц = Выборка.ПрибыльУбытокОборот;
	КонецЕсли;
	
	Выборка= РезультатЗапроса[2].Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.ПрибыльУбытокСНачалаГода = Выборка.ПрибыльУбытокОборот;
	КонецЕсли;

	Выборка= РезультатЗапроса[3].Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.НереализованныйPnL = Выборка.НереализованныйPnL;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СтоимостьПортфеля

&НаКлиенте
Процедура ОбновитьФинРез() Экспорт

	ФинансовыеПоказатели = ФинансовыеПоказатели();
	СтоимостьПортфеля = ФинансовыеПоказатели.СтоимостьОстаток;
	РеализованныйPnLЗаМесяц = ФинансовыеПоказатели.ПрибыльУбытокЗаМесяц;
	РеализованныйPnLСначалаГода = ФинансовыеПоказатели.ПрибыльУбытокСНачалаГода;
	
	ПодключитьОбработчикОжидания("ОбновитьФинРез", 60, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетФинРез(ЗаПериод)
	
	Если ЗаПериод = "СНачалаГода" Тогда
		НачалоПериода = НачалоГода(ТекущаяДата());
	ИначеЕсли ЗаПериод = "ЗаМесяц" Тогда
		НачалоПериода =  ДобавитьМесяц(ТекущаяДата(), -1);
	Иначе
		НачалоПериода = Неопределено;
	КонецЕсли;
	УсловияОтбора = Новый Структура("НачалоПериода, КонецПериода", НачалоПериода, ТекущаяДата());
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	ОткрытьФорму("Отчет.ФинРез.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура РеализованныйPnLСначалаГодаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьОтчетФинРез("СНачалаГода");
КонецПроцедуры

&НаКлиенте
Процедура РеализованныйPnLЗаМесяцНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьОтчетФинРез("ЗаМесяц");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьПортфеляНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Неопределено, Истина);
	ОткрытьФорму("Отчет.ПозицииНаДату.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура НереализованныйPnLНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Неопределено, Истина);
	ОткрытьФорму("Отчет.Портфель.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры
