#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем
	
//Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
//	
//	ПараметрыВыборки = Параметры.ПараметрыВыборки;
//	ПараметрыВыборки.ПолныеИменаОбъектов = "Справочник.ИсточникиДанных";
//	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Адрес УБЫВ");
//	ПараметрыВыборки.ПоляУпорядочиванияПриобработкеДанных.Добавить("Адрес УБЫВ");
//	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ИсточникиДанных.Ссылка КАК Ссылка
//	|ИЗ
//	|	Справочник.ИсточникиДанных КАК ИсточникиДанных";
//	
//	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
//	
//КонецПроцедуры

//Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
//	
//	ПолноеИмяОбъекта = "Справочник.ИсточникиДанных";
//	
//	//НачатьТранзакцию();
//	//Попытка
//	//	СервисТИнвест = Справочники.ИсточникиДанных.СоздатьЭлемент();
//	//	СервисТИнвест.ИмяПредопределенныхДанных = "СервисТИнвест";
//	//	СервисТИнвест.Адрес = "invest-public-api.tbank.ru";
//	//	СервисТИнвест.Путь = "/rest/tinkoff.public.invest.api.contract.v1.InstrumentsService/";
//	//	СервисТИнвест.Порт = 443;
//	//	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СервисТИнвест);
//	//	
//	//	ЗафиксироватьТранзакцию();
//	//Исключение
//	//	ОтменитьТранзакцию();
//	//	//ОбновлениеИнформационнойБазы.сообщитьонеуд
//	//	ЗаписьЖурналаРегистрации(
//	//	НСтр("ru = 'Создание источника данных'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
//	//	УровеньЖурналаРегистрации.Ошибка,
//	//	СервисТИнвест.Метаданные(),
//	//	СервисТИнвест.Ссылка,
//	//	СтрШаблон(
//	//	НСтр("ru = 'Не удалось создать источник данных %1 по причине:
//	//	|%2'"),
//	//	СервисТИнвест,
//	//	ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
//	//	ВызватьИсключение;
//	//КонецПопытки;
//	//
//	////Обновляемыеданные = ОбновлениеИнформационнойбазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
//	////
//	////Если ОбновляемыеДанные. Количество () = 0 Тогда
//	////	
//	////	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
//	////		Параметры.Очередь, ПолноеИмяОбъекта);
//	////	Возврат;
//	////	
//	////КонецЕсли;
//	////
//	////Для каждого ДанныеДокумента Из ОбновляемыеДанные Цикл
//	////	
//	////	НачатьТранзакцию();
//	////	Попытка
//	////		Блокировка = Новый БлокировкаДанных;
//	////		ЭлементБлокировки = Блокировка.Добавить("Документ.Сделка");
//	////		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДанныеДокумента.Ссылка);
//	////		Блокировка.Заблокировать();
//	////		
//	////		ДокументОбъект = ДанныеДокумента.Ссылка.ПолучитьОбъект();
//	////		
//	////		Для Каждого СтрокаТЧ Из ДокументОбъект.Позиции Цикл
//	////			СтрокаТЧ.Количество = СтрокаТЧ.КоличествоЛотов * ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Инструмент, "РазмерЛота");
//	////		КонецЦикла;
//	////		
//	////		РежимЗаписи = ?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
//	////		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, , , РежимЗаписи);
//	////		
//	////		ЗафиксироватьТранзакцию();
//	////	Исключение
//	////		ОтменитьТранзакцию();
//	////		//ОбновлениеИнформационнойБазы.сообщитьонеуд
//	////		ЗаписьЖурналаРегистрации(
//	////			НСтр("ru = 'Заполнение количества в сделках'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
//	////			УровеньЖурналаРегистрации.Ошибка,
//	////			ДокументОбъект.Метаданные(),
//	////			ДокументОбъект.Ссылка,
//	////			СтрШаблон(
//	////				НСтр("ru = 'Не Удалось ... в %1 по причине:
//	////					|%2'"),
//	////				ДокументОбъект,
//	////				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
//	////		//ВызватьИсключение;
//	////	КонецПопытки;
//	////	
//	////КонецЦикла;
//	//
//	//Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(ОбновляемыеДанные, ПолноеИмяОбъекта)
//	
//КонецПроцедуры // ОбработатьДанныеДляПереходаНаНовуюВерсию_1_0_1_4

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов
// 
// Параметры:
//  Настройки - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов.Настройки
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	//Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ТИнвест";
	Элемент.Адрес = НСтр("ru = 'invest-public-api.tbank.ru'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Наименование = НСтр("ru = 'СервисТИнвест'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Порт = 443;
	Элемент.Путь = НСтр("ru = '/rest/tinkoff.public.invest.api.contract.v1.InstrumentsService/'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти