Процедура ЗагрузкаДневныхСвечей() Экспорт
    
    ПараметрыЗагрузки = Новый Структура;
    ПараметрыЗагрузки.Вставить("Таймфрейм", Перечисления.ТаймфреймыСвечей._Day);
    ПараметрыЗагрузки.Вставить("ВариантИсточникаИнструментов", Перечисления.ВариантыИсточникаИнструментов.ТекущиеПозиции);
    ПараметрыЗагрузки.Вставить("РежимЗагрузки", Перечисления.РежимыЗагрузкиСвечей.Дозагрузка);
    ПараметрыЗагрузки.Вставить("ДатаНачала", НачалоГода(ТекущаяДатаСеанса()));
    ПараметрыЗагрузки.Вставить("ДатаОкончания", ТекущаяДатаСеанса());
    ПараметрыЗагрузки.Вставить("Платформа", Справочники.Платформы.ТИнвестиции);
    ПараметрыЗагрузки.Вставить("Счет", Неопределено);
    ПараметрыЗагрузки.Вставить("СписокИнструментов", Неопределено);
    
    Результат = СвечиСервис.ЗагрузитьСвечи(ПараметрыЗагрузки);
	
	Уровень = ?(Результат.Ошибок = 0, УровеньЖурналаРегистрации.Информация, УровеньЖурналаРегистрации.Ошибка);
	
	Комментарий = "";
	Для Каждого КлючИЗначение Из Результат Цикл
		Комментарий = Комментарий + КлючИЗначение.Ключ + ": " + КлючИЗначение.Значение + Символы.ПС;
	КонецЦикла;
	ЗаписьЖурналаРегистрации("Загрузка дневных свечей", Уровень, Метаданные.РегламентныеЗадания.ЗагрузкаДневныхСвечей,, Комментарий);
    
КонецПроцедуры
