
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние("Получаем цены...");
	КоличествоЗаписей = Неопределено;
	ПолучитьПоследниеЦеныПоИнструментамНаСервере(КоличествоЗаписей);
	Если ЗначениеЗаполнено(КоличествоЗаписей) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузки", ЭтотОбъект);
		ПоказатьПредупреждение(ОписаниеОповещения, "Записано цен: " + КоличествоЗаписей);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьПоследниеЦеныПоИнструментамНаСервере(КоличествоЗаписей)
	СоединениеTInvest = ИнтеграцияTInvestAPI.TI_СоздатьHTTPСоединение();
	ИнтеграцияTInvestAPI.TI_ПолучитьПоследниеЦеныПоИнструментам(, КоличествоЗаписей, , СоединениеTInvest);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузки(ДопПараметры)

	ОткрытьФорму("РегистрСведений.ИсторияЦенИнструментов.ФормаСписка");

КонецПроцедуры // ПослеЗагрузки()


