
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние("Получаем цены...");
	КоличествоЗаписей = Неопределено;
	ms_РаботаСREST.ПолучитьПоследниеЦеныПоИнструментам(, КоличествоЗаписей);
	Если ЗначениеЗаполнено(КоличествоЗаписей) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузки", ЭтотОбъект);
		ПоказатьПредупреждение(ОписаниеОповещения, "Записано цен: " + КоличествоЗаписей);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузки(ДопПараметры)

	ОткрытьФорму("РегистрСведений.ТекущиеЦены.ФормаСписка");

КонецПроцедуры // ПослеЗагрузки()


