
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	Состояние("Получаем цены...");
	КоличествоЗаписей = Неопределено;
	ms_РаботаСREST.ПолучитьПоследниеЦеныПоИнструментам(, КоличествоЗаписей);
	Если ЗначениеЗаполнено(КоличествоЗаписей) Тогда
		ПоказатьПредупреждение(, "Записано цен: " + КоличествоЗаписей);
	КонецЕсли;
	
КонецПроцедуры

