
Функция КурсВалютыНаДату(Дата, Валюта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		
		Если Выборка.Кратность = 0 Тогда
			ВызватьИсключение СтрШаблон("Не указана кратность курса валюты %1 на %2", Валюта, Формат(Дата, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
		
		Возврат Выборка.Курс / Выборка.Кратность
		
	Иначе
		
		Возврат Неопределено
		
	КонецЕсли;
	
КонецФункции
