&НаСервере
Функция ВыполнитьЗагрузку() Экспорт
    
    ПараметрыЗагрузки = Новый Структура;
    ПараметрыЗагрузки.Вставить("Таймфрейм", Таймфрейм);
    ПараметрыЗагрузки.Вставить("ВариантИсточникаИнструментов", ВариантИсточникаИнструментов);
    ПараметрыЗагрузки.Вставить("РежимЗагрузки", РежимЗагрузки);
    ПараметрыЗагрузки.Вставить("ДатаНачала", Период.ДатаНачала);
    ПараметрыЗагрузки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	//ПараметрыЗагрузки.Вставить("Платформа", Платформа);
	//ПараметрыЗагрузки.Вставить("Счет", Счет);
    ПараметрыЗагрузки.Вставить("СписокИнструментов", СписокИнструментов);
    
    Возврат СвечиСервис.ЗагрузитьСвечи(ПараметрыЗагрузки);
    
КонецФункции