Перем ирПлатформа Экспорт;
Перем ирПерехватКлавиатуры Экспорт;

// Аварийное завершение конфигуратора и клиентского приложения https://www.hostedredmine.com/issues/982118
// Чтобы его избежать отключай автопроверку модуля и располагай обработчики с английскими подключениями в конце и уменьшай их количество.

//&After("BeforeExit")
&После("ПередЗавершениемРаботыСистемы")
Процедура ирПередЗавершениемРаботыСистемы(Отказ)
	#Если Не ВебКлиент И Не МобильныйКлиент Тогда
	ПередЗавершениемРаботыСистемыЛкс(Отказ);
	#КонецЕсли 
КонецПроцедуры

//&After("OnExit")
&После("ПриЗавершенииРаботыСистемы")
Процедура ирПриЗавершенииРаботыСистемы()
	#Если Не ВебКлиент И Не МобильныйКлиент Тогда
	ПриЗавершенииРаботыСистемыЛкс();
	#КонецЕсли 
КонецПроцедуры

&After("OnStart")
&После("ПриНачалеРаботыСистемы")
Процедура ирПриНачалеРаботыСистемы()
	#Если Не ВебКлиент И Не МобильныйКлиент Тогда
	Если ирСервер.ПриНачалеРаботыСистемыРасширениеЛкс(ПараметрЗапуска) Тогда 
		ирКлиент.ПерезапуститьСеансПослеДобавленияРолиЛкс();
	Иначе
		ОткрытьОднократноАдаптациюРасширенияЛкс(ирПерехватКлавиатуры);
	КонецЕсли; 
	#КонецЕсли 
КонецПроцедуры

&After("ExternEventProcessing")
&После("ОбработкаВнешнегоСобытия")
Процедура ирОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	#Если Не ВебКлиент И Не МобильныйКлиент Тогда
	Если Источник = "KeyboardHook" Тогда
		ВнешнееСобытиеЛкс(Источник, Событие, Данные);
	КонецЕсли; 
	#КонецЕсли 
КонецПроцедуры
