Перем ирПлатформа Экспорт;
Перем ирПерехватКлавиатуры Экспорт;

// Аварийное завершение конфигуратора и клиентского приложения https://www.hostedredmine.com/issues/982118
// Чтобы его избежать отключай автопроверку модуля и располагай обработчики с английскими подключениями в конце и уменьшай их количество.

//&After("BeforeExit")
&После("ПередЗавершениемРаботыСистемы")
Процедура ирПередЗавершениемРаботыСистемы(Отказ)
	ПередЗавершениемРаботыСистемыЛкс(Отказ);
КонецПроцедуры

//&After("OnExit")
&После("ПриЗавершенииРаботыСистемы")
Процедура ирПриЗавершенииРаботыСистемы()
	ПриЗавершенииРаботыСистемыЛкс();
КонецПроцедуры

&After("OnStart")
&После("ПриНачалеРаботыСистемы")
Процедура ирПриНачалеРаботыСистемы()
	Если ирСервер.ПриНачалеРаботыСистемыРасширениеЛкс(ПараметрЗапуска) Тогда
		ирКлиент.ПерезапуститьСеансПослеДобавленияРолиЛкс();
	Иначе
		ОткрытьОднократноАдаптациюРасширенияЛкс(ирПерехватКлавиатуры);
	КонецЕсли;
	Если Истина
		И ПравоДоступа("Использование", Метаданные.Обработки.ирПортативный)
		И Найти(ПараметрЗапуска, "ОткрытьСтартерИР") = 0
	Тогда
		Обработки.ирПортативный.ПолучитьФорму().Открыть();
	КонецЕсли;
КонецПроцедуры

&After("ExternEventProcessing") 
&После("ОбработкаВнешнегоСобытия")
Процедура ирОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	Если Источник = "KeyboardHook" Тогда
		ВнешнееСобытиеЛкс(Источник, Событие, Данные);
	КонецЕсли;
КонецПроцедуры
