
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Обработка.ms_ЗагрузкаОпераций.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

//&НаСервере
//Процедура ЗагрузитьДневныеСвечиПоИнструменту(Инструмент, ДатаНачала, ДатаОкончания)
//    
//    Количество = РыночныеДанныеСервис.ЗагрузитьСвечиПоИнструменту(
//        Инструмент,
//        ДатаНачала,
//        ДатаОкончания,
//        Перечисления.ТаймфреймыСвечей.Day
//    );
//    
//    Сообщить("Загружено/обновлено свечей: " + Количество);
//    
//КонецПроцедуры