#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем
	
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = "Документ.Сделка";
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриобработкеДанных.Добавить("Дата УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Сделка КАК Т
	|ГДЕ
	|	НЕ Т.ПометкаУдаления";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию_1_0_1_4(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "Документ.Сделка";
	Обновляемыеданные = ОбновлениеИнформационнойбазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные. Количество () = 0 Тогда
		
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
			Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
		
	КонецЕсли;
	
	Для каждого ДанныеДокумента Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.Сделка");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ДанныеДокумента.Ссылка);
			Блокировка.Заблокировать();
			
			ДокументОбъект = ДанныеДокумента.Ссылка.ПолучитьОбъект();
			
			Для Каждого СтрокаТЧ Из ДокументОбъект.Позиции Цикл
				СтрокаТЧ.Количество = СтрокаТЧ.КоличествоЛотов * ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Инструмент, "РазмерЛота");
			КонецЦикла;
			
			РежимЗаписи = ?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, , , РежимЗаписи);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			//ОбновлениеИнформационнойБазы.сообщитьонеуд
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Заполнение количества в сделках'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				ДокументОбъект.Метаданные(),
				ДокументОбъект.Ссылка,
				СтрШаблон(
					НСтр("ru = 'Не Удалось ... в %1 по причине:
						|%2'"),
					ДокументОбъект,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			//ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(ОбновляемыеДанные, ПолноеИмяОбъекта)
	
КонецПроцедуры // ОбработатьДанныеДляПереходаНаНовуюВерсию_1_0_1_4

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию_1_0_1_6(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "Документ.Сделка";
	Обновляемыеданные = ОбновлениеИнформационнойбазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные. Количество () = 0 Тогда
		
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
			Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
		
	КонецЕсли;
	
	Для каждого ДанныеДокумента Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.Сделка");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ДанныеДокумента.Ссылка);
			Блокировка.Заблокировать();
			
			ДокументОбъект = ДанныеДокумента.Ссылка.ПолучитьОбъект();
			
			ВалютаСделки = Неопределено;
			Для Каждого СтрокаТЧ Из ДокументОбъект.Позиции Цикл
				
				Если ЗначениеЗаполнено(ВалютаСделки) Тогда 
					
					Если ВалютаСделки <> СтрокаТЧ.ВалютаСделки Тогда
						ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Документ %1 не обработан - разные валюты в табличной части!", ДанныеДокумента.Ссылка), ДанныеДокумента.Ссылка);
						Продолжить;
					КонецЕсли;
					
				Иначе
					
					ВалютаСделки = СтрокаТЧ.ВалютаСделки;
				
				КонецЕсли;
				
			КонецЦикла;

			ДокументОбъект.ВалютаСделки = ВалютаСделки;
			ДокументОбъект.КурсСделки = РасчетыВДокументах.КурсВалютыНаДату(ДокументОбъект.Дата, ДокументОбъект.ВалютаСделки);
			
			РежимЗаписи = ?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, , , РежимЗаписи);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			//ОбновлениеИнформационнойБазы.сообщитьонеуд
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Заполнение количества в сделках'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				ДокументОбъект.Метаданные(),
				ДокументОбъект.Ссылка,
				СтрШаблон(
					НСтр("ru = 'Не Удалось ... в %1 по причине:
						|%2'"),
					ДокументОбъект,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			//ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(ОбновляемыеДанные, ПолноеИмяОбъекта)
	
КонецПроцедуры // ОбработатьДанныеДляПереходаНаНовуюВерсию_1_0_1_6

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти