#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьИнструментПоУИД(UID) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Инструменты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Инструменты КАК Инструменты
		|ГДЕ
		|	Инструменты.UID = &UID
		|	И не Инструменты.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("UID", UID);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		НовыйИнструмент = СоздатьИнструмент(UID);
		Возврат НовыйИнструмент;
	КонецЕсли;

КонецФункции // ПолучитьИнструментПоУИД()

#КонецОбласти

#Область ОбработчикиСобытий
  // Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
  // Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьИнструмент(UID)
	
	Отказ = Ложь;
	СоединениеTInvest = ИнтеграцияTInvestAPI.TI_СоздатьHTTPСоединение();
	Данные = ИнтеграцияTInvestAPI.TI_ОсновнаяИнформацияОбИнструменте(UID, , "INSTRUMENT_ID_TYPE_UID", , , СоединениеTInvest);
	
	Если ЗначениеЗаполнено(Данные) И Данные.Свойство("instrument") Тогда
		ИнструментОбъект = Справочники.Инструменты.СоздатьЭлемент();
		ДанныеИнструмента = Данные.instrument;
		ЗаполнитьЗначенияСвойств(ИнструментОбъект, ДанныеИнструмента);
		ИнструментОбъект.РазмерЛота = ДанныеИнструмента.lot;
		ИнструментОбъект.Наименование = ДанныеИнструмента.name;
		ИнструментОбъект.ВалютаНоминала = Справочники.Валюты.НайтиПоНаименованию(ДанныеИнструмента.currency);
		Если Не ЗначениеЗаполнено(ИнструментОбъект.ВалютаНоминала) И ЗначениеЗаполнено(ДанныеИнструмента.currency) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не найдена валюта " + ДанныеИнструмента.currency, , , , Отказ);
		КонецЕсли;
		Если Не Отказ Тогда
			ИнструментОбъект.Записать();
			ОбщегоНазначения.СообщитьПользователю("Записан новый инструмент " + ИнструментОбъект, ИнструментОбъект.Ссылка);
			
			Возврат ИнструментОбъект.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции // СоздатьИнструмент()

#КонецОбласти

#Область Инициализация

#КонецОбласти