Процедура ПередЗаписью(Отказ)

	// 1. Проверка по UID
	Если ЗначениеЗаполнено(UID) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.Инструменты
		|ГДЕ
		|	UID = &UID
		|	И Ссылка <> &ТекущаяСсылка";
		
		Запрос.УстановитьПараметр("UID", UID);
		Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Инструмент с таким UID уже существует", Выборка.Ссылка);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	// 2. Проверка по Тикер + classCode (если UID пуст)
	Если //НЕ ЗначениеЗаполнено(UID)
	   //И 
	   ЗначениеЗаполнено(Тикер)
	   И ЗначениеЗаполнено(ClassCode) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.Инструменты
		|ГДЕ
		|	Тикер = &Тикер
		|	И ClassCode = &ClassCode
		|	И Ссылка <> &ТекущаяСсылка";
		
		Запрос.УстановитьПараметр("Тикер", Тикер);
		Запрос.УстановитьПараметр("ClassCode", ClassCode);
		Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Инструмент с таким тикером и рынком уже существует", Выборка.Ссылка);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
