&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Владелец = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Справочник.ИсточникиДанных");
	ИмяСервиса = Справочники.ИсточникиДанных.ТИнвест.Наименование;
	Токен = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец, ИмяСервиса);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()

	Владелец = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Справочник.ИсточникиДанных");
	
	УстановитьПривилегированныйРежим(Истина);
	//Для Каждого Параметр Из ПараметрыАвторизации Цикл
	//	Если Параметр.Представление <> Строка(УникальныйИдентификатор) Тогда
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Владелец, Токен, ИмяСервиса);
	//	КонецЕсли;
	//КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры
