
&НаСервере
Функция ПолучитьРеквизитыИнструментаИзТИнвестНаСервере(СтрокаПоиска)
	
	Если Объект.ТипИнструмента = Перечисления.ТипыИнструментов.Акция Тогда
		ТипИнструмента = "INSTRUMENT_TYPE_SHARE"
	ИначеЕсли Объект.ТипИнструмента = Перечисления.ТипыИнструментов.Облигация Тогда
		ТипИнструмента = "INSTRUMENT_TYPE_BOND";
	Иначе
		ТипИнструмента = Неопределено;
	КонецЕсли;
	
	//Данные = РаботаСREST.TInvest_НайтиИнструмент(, СтрокаПоиска, ТипИнструмента);
	//Если ЗначениеЗаполнено(Данные) и Данные.Свойство("instruments") Тогда
	//	ДанныеИнструмента = Данные.instruments[0];
	//	Если Данные.instruments.Количество() > 1 Тогда
	//		Сообщить("нашли несколько");
	//		Возврат;
	//	КонецЕсли;
	//	ЗаполнитьЗначенияСвойств(Объект, ДанныеИнструмента);
	//	Объект.РазмерЛота = ДанныеИнструмента.lot;
	//	Объект.Тикер = ДанныеИнструмента.ticker;
	//	Объект.Наименование = ДанныеИнструмента.name;
	//	Если ДанныеИнструмента.instrumentType = "share" Тогда
	//		Объект.ТипИнструмента = Перечисления.ТипыИнструментов.Акция;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Данные = РаботаСREST.TInvest_ОсновнаяИнформацияОбИнструменте(, Объект.Тикер, Объект.classCode);
	//
	//Если ЗначениеЗаполнено(Данные) и Данные.Свойство("instrument") Тогда
	//	ДанныеИнструмента = Данные.instrument;
	//	ЗаполнитьЗначенияСвойств(Объект, ДанныеИнструмента);
	//	Объект.РазмерЛота = ДанныеИнструмента.lot;
	//	Объект.Наименование = ДанныеИнструмента.name;
	//	Объект.ВалютаНоминала = Справочники.Валюты.НайтиПоНаименованию(ДанныеИнструмента.currency);
	//	//Если ДанныеИнструмента.instrumentType = "share" Тогда
	//	//	Объект.ТипИнструмента = Перечисления.ТипыИнструментов.Акция;
	//	//КонецЕсли;
	//КонецЕсли;

	
	Данные = ms_РаботаСREST.TInvest_НайтиИнструмент(СтрокаПоиска, ТипИнструмента);
	Если ЗначениеЗаполнено(Данные) и Данные.Свойство("instruments") Тогда
		Если Данные.instruments.Количество() > 1 Тогда
			//Сообщить("нашли несколько");
			Возврат Данные.instruments;
		ИначеЕсли Данные.instruments.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Не найден " + СтрокаПоиска);
			Возврат Неопределено;
		КонецЕсли;
		ДанныеИнструмента = Данные.instruments[0];
		ЗаполнитьРеквизитыИнструментаИзСтруктуры(ДанныеИнструмента);
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не найден " + СтрокаПоиска);
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Объект.Тикер) И ЗначениеЗаполнено(Объект.classCode) Тогда
	//	
	//	Данные = РаботаСREST.TInvest_ОсновнаяИнформацияОбИнструменте2(Объект.Тикер, Объект.classCode);
	//	
	//	Если ЗначениеЗаполнено(Данные) и Данные.Свойство("instrument") Тогда
	//		ДанныеИнструмента = Данные.instrument;
	//		ЗаполнитьЗначенияСвойств(Объект, ДанныеИнструмента);
	//		Объект.РазмерЛота = ДанныеИнструмента.lot;
	//		Объект.Наименование = ДанныеИнструмента.name;
	//		Объект.ВалютаНоминала = Справочники.Валюты.НайтиПоНаименованию(ДанныеИнструмента.currency);
	//		//Если ДанныеИнструмента.instrumentType = "share" Тогда
	//		//	Объект.ТипИнструмента = Перечисления.ТипыИнструментов.Акция;
	//		//КонецЕсли;
	//	КонецЕсли;

	//КонецЕсли;
	
	Возврат Истина;
		
КонецФункции

&НаСервере
Функция ЗаполнитьРеквизитыИнструментаИзСтруктуры(ДанныеИнструмента)
	
	ЗаполнитьЗначенияСвойств(Объект, ДанныеИнструмента);
	Объект.РазмерЛота = ДанныеИнструмента.lot;
	Объект.Тикер = ДанныеИнструмента.ticker;
	Объект.Наименование = ДанныеИнструмента.name;
	Если ДанныеИнструмента.instrumentType = "share" Тогда
		Объект.ТипИнструмента = Перечисления.ТипыИнструментов.Акция;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Тикер) И 
		ЗначениеЗаполнено(Объект.classCode) И 
		Не ЗначениеЗаполнено(Объект.ВалютаНоминала) Тогда
		
		Данные = ms_РаботаСREST.TInvest_ОсновнаяИнформацияОбИнструменте(Объект.Тикер, Объект.classCode);
		
		Если ЗначениеЗаполнено(Данные) и Данные.Свойство("instrument") Тогда
			ДанныеИнструмента = Данные.instrument;
			ЗаполнитьЗначенияСвойств(Объект, ДанныеИнструмента);
			//Объект.РазмерЛота = ДанныеИнструмента.lot;
			//Объект.Наименование = ДанныеИнструмента.name;
			Объект.ВалютаНоминала = Справочники.Валюты.НайтиПоНаименованию(ДанныеИнструмента.currency);
			//Если ДанныеИнструмента.instrumentType = "share" Тогда
			//	Объект.ТипИнструмента = Перечисления.ТипыИнструментов.Акция;
			//КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	
	Возврат Истина;
		
КонецФункции


&НаКлиенте
Процедура ПолучитьРеквизитыИнструментаИзТИнвест(Команда)
	
	Если ЗначениеЗаполнено(Элементы.Тикер.ТекстРедактирования) Тогда
		СтрокаПоиска = Элементы.Тикер.ТекстРедактирования;
	ИначеЕсли ЗначениеЗаполнено(Элементы.Наименование.ТекстРедактирования) Тогда
		СтрокаПоиска = Элементы.Наименование.ТекстРедактирования;
	//ИначеЕсли ЗначениеЗаполнено(Элементы.Тикер.ТекстРедактирования) Тогда
	//	СтрокаПоиска = Элементы.Тикер.ТекстРедактирования;
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполни наименование или тикер", Объект, "Тикер");
		Возврат;
	КонецЕсли;
	Результат = ПолучитьРеквизитыИнструментаИзТИнвестНаСервере(СтрокаПоиска);
	Если Результат <> Истина И ТипЗнч(Результат) = Тип("Массив") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("МассивСтруктур", Результат);
		ОткрытьФорму("ОбщаяФорма.ms_ФормаВыбораИзТаблицы", ПараметрыФормы, ЭтаФорма, ЭтаФорма, ВариантОткрытияОкна.ОтдельноеОкно,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере(ДанныеИнструмента)
	
	ЗаполнитьРеквизитыИнструментаИзСтруктуры(ДанныеИнструмента);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыбранИнструмент" Тогда
		ОбработкаОповещенияНаСервере(Параметр);
	КонецЕсли;
	
КонецПроцедуры


//InstrumentType
//Name	Number	Description
//INSTRUMENT_TYPE_UNSPECIFIED	0	Тип инструмента не определен
//INSTRUMENT_TYPE_BOND	1	Облигация
//INSTRUMENT_TYPE_SHARE	2	Акция
//INSTRUMENT_TYPE_CURRENCY	3	Валюта
//INSTRUMENT_TYPE_ETF	4	Exchange-traded fund
//INSTRUMENT_TYPE_FUTURES	5	Фьючерс
//INSTRUMENT_TYPE_SP	6	Структурная нота
//INSTRUMENT_TYPE_OPTION	7	Опцион
//INSTRUMENT_TYPE_CLEARING_CERTIFICATE	8	Clearing certificate
//INSTRUMENT_TYPE_INDEX	9	Индекс
//INSTRUMENT_TYPE_COMMODITY	10	Товар