#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыбранИнструмент" Тогда
		ОбработкаОповещенияНаСервере(Параметр);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
  // Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
  // Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьРеквизитыИнструментаИзТИнвест(Команда)
	
	Если ЗначениеЗаполнено(Элементы.Тикер.ТекстРедактирования) Тогда
		СтрокаПоиска = Элементы.Тикер.ТекстРедактирования;
	ИначеЕсли ЗначениеЗаполнено(Элементы.Наименование.ТекстРедактирования) Тогда
		СтрокаПоиска = Элементы.Наименование.ТекстРедактирования;
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполни тикер или наименование", Объект, "Тикер");
		Возврат;
	КонецЕсли;
	
	Результат = ПолучитьРеквизитыИнструментаИзТИнвестНаСервере(СтрокаПоиска);
	Если Результат <> Истина И ТипЗнч(Результат) = Тип("Массив") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("МассивСтруктур", Результат);
		ОткрытьФорму("ОбщаяФорма.ms_ФормаВыбораИзТаблицы", ПараметрыФормы, ЭтаФорма, ЭтаФорма, 
				ВариантОткрытияОкна.ОтдельноеОкно, , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьРеквизитыИнструментаИзТИнвестНаСервере(Знач СтрокаПоиска)
	
	ТипИнструмента = ИнструментыБрокера.InstrumentTypeСервисаПоТипуИнструмента(Объект.ТипИнструмента);
	СоединениеTInvest = ИнтеграцияTInvestAPI.TI_СоздатьHTTPСоединение();
	
	Данные = ИнтеграцияTInvestAPI.TI_НайтиИнструмент(СтрокаПоиска, ТипИнструмента, , СоединениеTInvest);
	Если ЗначениеЗаполнено(Данные) И Данные.Свойство("instruments") Тогда
		Если Данные.instruments.Количество() > 1 Тогда
			//Сообщить("нашли несколько");
			Возврат Данные.instruments;
		ИначеЕсли Данные.instruments.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Не найден " + СтрокаПоиска);
			Возврат Неопределено;
		Иначе
			ДанныеИнструмента = Данные.instruments[0];
			ЗаполнитьРеквизитыИнструментаИзСтруктуры(ДанныеИнструмента);
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не найден " + СтрокаПоиска);
	КонецЕсли;
	
	Возврат Истина;
		
КонецФункции

&НаСервере
Процедура ОбработкаОповещенияНаСервере(Знач ДанныеИнструмента)
	
	ЗаполнитьРеквизитыИнструментаИзСтруктуры(ДанныеИнструмента);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРеквизитыИнструментаИзСтруктуры(ДанныеИнструмента)
	
	ЗаполнитьЗначенияСвойств(Объект, ДанныеИнструмента);
	Объект.РазмерЛота = ДанныеИнструмента.lot;
	Объект.Тикер = ДанныеИнструмента.ticker;
	Объект.Наименование = ДанныеИнструмента.name;
	Объект.ТипИнструмента = ИнструментыБрокера.ТипИнструментаПоInstrumentType(ДанныеИнструмента.instrumentKind);
	
	Если ЗначениеЗаполнено(Объект.Тикер)
		И ЗначениеЗаполнено(Объект.classCode)
		И Не ЗначениеЗаполнено(Объект.ВалютаНоминала) Тогда
		
		СоединениеTInvest = ИнтеграцияTInvestAPI.TI_СоздатьHTTPСоединение();
		Данные = ИнтеграцияTInvestAPI.TI_ОсновнаяИнформацияОбИнструменте(Объект.Тикер, Объект.classCode, , , , СоединениеTInvest);
		
		Если ЗначениеЗаполнено(Данные) Тогда
			Если Данные.Свойство("Ошибка") И Данные.Ошибка = Истина Тогда
				ТекстСообщения = СтрШаблон("%1 (Тикер:%2, classCode:%3)", 
									Данные.Свойство("ОписаниеОшибки"), Объект.Тикер, Объект.classCode);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат Ложь;
			КонецЕсли;
			Если Данные.Свойство("instrument") Тогда
				ДанныеИнструмента = Данные.instrument;
				ЗаполнитьЗначенияСвойств(Объект, ДанныеИнструмента);
				//Объект.РазмерЛота = ДанныеИнструмента.lot;
				//Объект.Наименование = ДанныеИнструмента.name;
				Объект.ВалютаНоминала = Справочники.Валюты.НайтиПоНаименованию(ДанныеИнструмента.currency);
				//Если ДанныеИнструмента.instrumentType = "share" Тогда
				//	Объект.ТипИнструмента = Перечисления.ТипыИнструментов.Акция;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	
	Возврат Истина;
		
КонецФункции

#КонецОбласти
