Функция ПолучитьИнтервалСвечейAPI(Таймфрейм) Экспорт
    
    // Подстрой под своё перечисление ТаймфреймыСвечей.
    
    Если Таймфрейм = Перечисления.ТаймфреймыСвечей._Week Тогда
        Возврат "CANDLE_INTERVAL_WEEK";
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей._Day Тогда
        Возврат "CANDLE_INTERVAL_DAY";
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей._1Hour Тогда
        Возврат "CANDLE_INTERVAL_HOUR";
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей._15Min Тогда
        Возврат "CANDLE_INTERVAL_15_MIN";
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей._5Min Тогда
        Возврат "CANDLE_INTERVAL_5_MIN";
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей._1Min Тогда
        Возврат "CANDLE_INTERVAL_1_MIN";
    КонецЕсли;
    
    ВызватьИсключение "Неизвестный таймфрейм: " + Строка(Таймфрейм);
    
КонецФункции

