
&НаКлиенте
Процедура ПолучитьСчетаПользователяТИнвест(Команда)
	
	ПолучитьСчетаПользователяТИнвестНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСчетаПользователяТИнвестНаСервере()
	СоединениеTInvest = ИнтеграцияTInvestAPI.TI_СоздатьHTTPСоединение();
	ИнтеграцияTInvestAPI.TI_ПолучитьСчетаПользователя(, СоединениеTInvest);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПортфель(Команда)
	
	Состояние("Загрузка данных по счетам...");
	ПолучитьПортфельПоСчетамНаСервере();
	ОткрытьФорму("РегистрСведений.ИмпортДанныхБрокера.ФормаСписка");
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервереБезКонтекста
Процедура ПолучитьПортфельПоСчетамНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Счета.Ссылка КАК Ссылка,
		|	Счета.AccountId КАК AccountId,
		|	Счета.Представление КАК Представление
		|ИЗ
		|	Справочник.Счета КАК Счета
		|ГДЕ
		|	Счета.Платформа = ЗНАЧЕНИЕ(Справочник.Платформы.ТИнвестиции)
		|	И Счета.Активен
		|	И НЕ Счета.ПодключенКСтратегии";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаСчета = РезультатЗапроса.Выбрать();
	Пока ВыборкаСчета.Следующий() Цикл
		ИнтеграцияTInvestРыночныеДанные.ЗагрузитьПортфельПоСчету(ВыборкаСчета);
	КонецЦикла;

КонецПроцедуры // ПолучитьПортфельПоСчетамНаСервере()
