
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Заполнение ВТ Позиции
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаПозиции.НомерСтроки КАК НомерСтроки,
	|	СделкаПозиции.Инструмент КАК Инструмент,
	|	СделкаПозиции.Количество КАК Количество,
	|	СделкаПозиции.Валюта КАК Валюта,
	|	СделкаПозиции.Цена КАК Цена,
	|	СделкаПозиции.Комиссия КАК Комиссия
	|ПОМЕСТИТЬ Позиции
	|ИЗ
	|	&Позиции КАК СделкаПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Позиции.НомерСтроки КАК НомерСтроки,
	|	Позиции.Инструмент КАК Инструмент,
	|	Позиции.Количество КАК Количество,
	|	Позиции.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КурсыВалют.Кратность, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Позиции.Цена * ЕСТЬNULL(КурсыВалют.Курс, 0) / ЕСТЬNULL(КурсыВалют.Кратность, 0)
	|	КОНЕЦ КАК Цена,
	|	Инструменты.ТипИнструмента КАК ТипИнструмента,
	|	ВЫБОР
	|		КОГДА Инструменты.ТипИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыИнструментов.Валюта)
	|			ТОГДА 1
	|		ИНАЧЕ Инструменты.РазмерЛота
	|	КОНЕЦ КАК РазмерЛота
	|ИЗ
	|	Позиции КАК Позиции
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
	|		ПО Позиции.Валюта = КурсыВалют.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Инструменты КАК Инструменты
	|		ПО Позиции.Инструмент = Инструменты.Ссылка";
	
	Запрос.УстановитьПараметр("Позиции", Позиции.Выгрузить());
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	Движения.ПозицииИнструментов.Записывать = Истина;
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
			Движение = Движения.ПозицииИнструментов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Счет = Счет;
			Движение.Инструмент = Выборка.Инструмент;
			//РазмерЛота = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Инструмент, "РазмерЛота");
			Движение.Количество = Выборка.Количество;
			Движение.Стоимость = Выборка.Количество * Выборка.Цена;
			//Движение.Стоимость = (ТекСтрокаПозиции.Количество * ТекСтрокаПозиции.Цена + ТекСтрокаПозиции.Комиссия) * РасчетыВДокументах.КурсВалютыНаДату(Дата, ТекСтрокаПозиции.Валюта);
		КонецЦикла;
		Движения.Записать();

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Позиции.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИмпортДанныхБрокераСрезПоследних.instrumentUid КАК instrumentUid,
		|	ИмпортДанныхБрокераСрезПоследних.Инструмент КАК Инструмент,
		|	ИмпортДанныхБрокераСрезПоследних.averagePositionPrice КАК Цена,
		|	ИмпортДанныхБрокераСрезПоследних.quantityLots КАК КоличествоЛотов,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Инструменты.ТипИнструмента, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыИнструментов.Валюта)
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(Инструменты.РазмерЛота, 0)
		|	КОНЕЦ КАК РазмерЛота,
		|	ИмпортДанныхБрокераСрезПоследних.quantityLots * ВЫБОР
		|		КОГДА ЕСТЬNULL(Инструменты.ТипИнструмента, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыИнструментов.Валюта)
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(Инструменты.РазмерЛота, 0)
		|	КОНЕЦ КАК Количество,
		|	ИмпортДанныхБрокераСрезПоследних.quantityLots * ИмпортДанныхБрокераСрезПоследних.averagePositionPrice * ВЫБОР
		|		КОГДА ЕСТЬNULL(Инструменты.ТипИнструмента, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыИнструментов.Валюта)
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(Инструменты.РазмерЛота, 0)
		|	КОНЕЦ КАК СуммаСделки,
		|	Валюты.Ссылка КАК Валюта
		|ИЗ
		|	РегистрСведений.ИмпортДанныхБрокера.СрезПоследних(&ДатаИмпорта, Счет = &Счет) КАК ИмпортДанныхБрокераСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Инструменты КАК Инструменты
		|		ПО ИмпортДанныхБрокераСрезПоследних.Инструмент = Инструменты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
		|		ПО ИмпортДанныхБрокераСрезПоследних.currency = Валюты.Наименование";
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Дата = ДанныеЗаполнения.Дата;
		Счет = ДанныеЗаполнения.Счет;
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаИмпорта", Дата);
	Запрос.УстановитьПараметр("Счет", Счет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Позиции.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если Не ЗначениеЗаполнено(НоваяСтрока.Инструмент) И ЗначениеЗаполнено(Выборка.instrumentUid) Тогда
			НоваяСтрока.Инструмент = Справочники.Инструменты.ПолучитьИнструментПоУИД(Выборка.instrumentUid);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверитьЗаполнение() = Ложь Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	//Описание = "";
	//ТЗПозиции = Позиции.Выгрузить(, "Инструмент");
	//ТЗПозиции.Свернуть("Инструмент");
	//Для Каждого СтрокаТ Из ТЗПозиции Цикл
	//	Описание = Описание + ?(ПустаяСтрока(Описание), "", ", ") + СтрокаТ.Инструмент;
	//КонецЦикла;
	
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции


#КонецОбласти