
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПросадкиПоСтратегиям = ПросадкиПоСтратегиям();
	
КонецПроцедуры


Функция ПросадкиПоСтратегиям()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФинансовыеРезультатыПоСделкам.Период КАК Период,
		|	ФинансовыеРезультатыПоСделкам.СтратегияСделки КАК СтратегияСделки,
		|	ФинансовыеРезультатыПоСделкам.ПрибыльУбыток КАК ПрибыльУбыток
		|ИЗ
		|	РегистрНакопления.ФинансовыеРезультатыПоСделкам КАК ФинансовыеРезультатыПоСделкам
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтратегияСделки,
		|	Период";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	ПросадкиПоСтратегиям = Новый ТаблицаЗначений;
	ПросадкиПоСтратегиям.Колонки.Добавить("СтратегияСделки", Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Тип("СправочникСсылка.СтратегииСделок"))));
	ПросадкиПоСтратегиям.Колонки.Добавить("МаксимальнаяПросадка", ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
	
	Стратегия = Неопределено;
	НакопленныйРезультат = 0;
	МаксНакопленныйРезультат = 0;
	Просадка = 0;
	МаксимальнаяПросадка = 0;
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СтратегияСделки <> Стратегия Тогда
			Если ЗначениеЗаполнено(Стратегия) Тогда
				НоваяСтрока = ПросадкиПоСтратегиям.Добавить();
				НоваяСтрока.СтратегияСделки = Стратегия;
				НоваяСтрока.МаксимальнаяПросадка = МаксимальнаяПросадка;
			КонецЕсли;
			Стратегия = Выборка.СтратегияСделки;
			НакопленныйРезультат = 0;
			МаксНакопленныйРезультат = 0;
			Просадка = 0;
			МаксимальнаяПросадка = 0;
		КонецЕсли;
		
		НакопленныйРезультат = НакопленныйРезультат + Выборка.ПрибыльУбыток;
		
		Если НакопленныйРезультат > МаксНакопленныйРезультат Тогда
			МаксНакопленныйРезультат = НакопленныйРезультат;
		КонецЕсли;
		
		Просадка = НакопленныйРезультат - МаксНакопленныйРезультат; // отрицательное число
		
		Если Просадка < МаксимальнаяПросадка Тогда
			МаксимальнаяПросадка = Просадка;
		КонецЕсли;
	КонецЦикла;
	
	НоваяСтрока = ПросадкиПоСтратегиям.Добавить();
	НоваяСтрока.СтратегияСделки = Стратегия;
	НоваяСтрока.МаксимальнаяПросадка = МаксимальнаяПросадка;
	
	Возврат ПросадкиПоСтратегиям;

КонецФункции // ПросадкиПоСтратегиям()
