Процедура ДобавитьРесурсы0(Ресурсы) Экспорт
	//ВызватьИсключение "mcp_РесурсыТест.ДобавитьРесурсы вызвался";
КонецПроцедуры

Процедура ДобавитьРесурсы(Ресурсы) Экспорт
	
	mcp_Метаданные.ДобавитьРесурс(Ресурсы, "mcp://test/hello", "hello", "Тестовый ресурс: проверка подключения")
	//// Добавим тестовый ресурс, чтобы проверить механику
	//НоваяСтрока = Ресурсы.Добавить();
	//НоваяСтрока.uri = "mcp://test/hello";
	//НоваяСтрока.name = "hello";
	//НоваяСтрока.description = "Тестовый ресурс: проверка подключения";

КонецПроцедуры

Функция ПрочитатьРесурс(URI) Экспорт
	
	Если URI = "mcp://test/hello" Тогда
		Возврат "Привет. Это ресурс из 1С расширения. Всё работает.";
	КонецЕсли;
	
	ВызватьИсключение "Неизвестный ресурс: " + URI;

КонецФункции