#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивСтруктур") Тогда
		СоздатьТаблицу(Параметры.МассивСтруктур);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
  // Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
  // Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
  // Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
  // Код процедур и функций
#КонецОбласти


&НаКлиенте
Процедура Выбрать(Команда)
	
	Таблица = Элементы["ТаблицаИнструментовНаФорме"];
	Если Таблица.ТекущаяСтрока <> Неопределено Тогда
		ВыбранныйИнструмент = Таблица.ТекущиеДанные.Структура;
		Закрыть(ВыбранныйИнструмент);
	КонецЕсли;
	Оповестить("ВыбранИнструмент", ВыбранныйИнструмент, ЭтаФорма);
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура СоздатьТаблицу(МассивСтруктур)

	ДобавляемыеРеквизиты = Новый Массив;
	
	//ТипРеквизита = Новый ОписаниеТипов("ТаблицаЗначений");
	//
	//РеквизитФормы = Новый РеквизитФормы(
	//	"ТаблицаИнструментов",  //Имя реквизита формы
	//	ТипРеквизита,     //Тип
	//	"",               //Путь  (Пусто, "Объект", ИмяТЧ)
	//					  // например "Объект.Товары"	
	//	"Таблица инструментов");//Заголовок
	//					  							 
	//ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
	//
	////Заставляем форму создать новые реквизиты
	//ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	//
	//////Обращение к реквизиту формы из кода
	////ЭтаФорма.АдресДоставки = "ул. Пушкина";
	//
	////Вывод реквизита на форму (при необходимости)
	//ПолеВвода = Элементы.Добавить("ФормаТаблицаИнструментов", Тип("Таблица"), ЭтаФорма);
	//ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	//ПолеВвода.ПутьКДанным = "ФормаТаблицаИнструментов";

	ТаблицаИнструментов = Новый ТаблицаЗначений;
	
	Инструмент = МассивСтруктур[0];
	Для Каждого СвойствоИнструмента Из Инструмент Цикл
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(СвойствоИнструмента.Значение));
		ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
		ТаблицаИнструментов.Колонки.Добавить(СвойствоИнструмента.Ключ, ОписаниеТипа);
	КонецЦикла;
	ТаблицаИнструментов.Колонки.Добавить("Структура");
	
	Для Каждого Инструмент Из МассивСтруктур Цикл
		
		СтрокаТ = ТаблицаИнструментов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТ, Инструмент);
		СтрокаТ.Структура = Инструмент;
	КонецЦикла;
	
	ВывестиТаблицуЗначенияВКодеВТаблицуНаФорме(ТаблицаИнструментов, "ТаблицаИнструментов", "ТаблицаИнструментовНаФорме");
	
КонецПроцедуры // СоздатьТаблицу()

&НаСервере
Процедура ВывестиТаблицуЗначенияВКодеВТаблицуНаФорме(ТабВКоде, ТабРеквизит, ТабНаФорме)
 
    // реквизит ТабРеквизит и соответствующий
    // ему элемент формы ТабНаФорме уже созданы
    // нами в визуальном режиме
 
    // 1. добавляем колонки из ТабВкоде в реквизит ТабРеквизит
 
    НовыеРеквизиты = Новый Массив;
	
	НовыеРеквизиты.Добавить(Новый РеквизитФормы(ТабРеквизит, Новый ОписаниеТипов("ТаблицаЗначений")));
	
    Для Каждого Колонка Из ТабВКоде.Колонки Цикл
         НовыеРеквизиты.Добавить(
            Новый РеквизитФормы(
                Колонка.Имя, Колонка.ТипЗначения,
                ТабРеквизит
            )
         );
    КонецЦикла;
 
    ИзменитьРеквизиты(НовыеРеквизиты);
 
    // 2. добавляем колонки из ТабВКоде в элемент ТабНаФорме
	
	ТаблицаФормы = Элементы.Добавить(ТабНаФорме, Тип("ТаблицаФормы"), ЭтаФорма);
    ТаблицаФормы.ПутьКДанным = ТабРеквизит;
    ТаблицаФормы.Заголовок = "Найденные инструменты";
    ТаблицаФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
    ТаблицаФормы.ИзменятьПорядокСтрок = Ложь;
    ТаблицаФормы.ИзменятьСоставСтрок = Ложь;
    ТаблицаФормы.РазрешитьНачалоПеретаскивания = Ложь;
	ТаблицаФормы.ТолькоПросмотр = Истина;
	
	Для Каждого Колонка Из ТабВКоде.Колонки Цикл
 
        НовыйЭлемент = Элементы.Добавить(
            ТабРеквизит + "_" + Колонка.Имя, Тип("ПолеФормы"), Элементы[ТабНаФорме]
        );
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлемент.ПутьКДанным = ТабРеквизит + "." + Колонка.Имя;
    КонецЦикла;
 
    // 3. наконец, передаём данные из ТабВКоде в ТабРеквизит
 
    ЗначениеВРеквизитФормы(ТабВКоде, ТабРеквизит);
 
    // готово!    
 
КонецПроцедуры

&НаКлиенте
Процедура Реквизит1ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
