#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) Тогда
		Период.ДатаНачала = ТекущаяДата() - 86400;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Период.ДатаОкончания = ТекущаяДата() - 86400;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
  // Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ВыполнитьЗагрузкуНаСервере()
	
	ИдентификаторСчета = Справочники.Счета.ИдентификаторСчета(Счет);
	
	ПрочитатьГотовыеДанные = Ложь;
	Если ПрочитатьГотовыеДанные Тогда
		ВременноеХранениеДанных = Справочники.ВременноеХранениеДанных.НайтиПоКоду("000000033");
		ДанныеСервиса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВременноеХранениеДанных, "ХранилищеЗначения").Получить();
	Иначе
		ДанныеСервиса = ms_РаботаСREST.TInvest_ПолучитьОперации(ИдентификаторСчета, Период.ДатаНачала, Период.ДатаОкончания);
		ВременноеХранениеДанных = Справочники.ВременноеХранениеДанных.СоздатьЭлемент();
		ВременноеХранениеДанных.ХранилищеЗначения = Новый ХранилищеЗначения(ДанныеСервиса, Новый СжатиеДанных(9));
		ВременноеХранениеДанных.Записать();
		ОбщегоНазначения.СообщитьПользователю("Записаны данные " + ВременноеХранениеДанных, ВременноеХранениеДанных);
		//Записаны данные 000000001
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСервиса) И ДанныеСервиса.Свойство("operations") Тогда
		Операции = ДанныеСервиса.operations;
	КонецЕсли;
	ms_РаботаСREST.TI_ИмпортироватьОперацииВСделки(Счет, Справочники.ИсточникиДанных.ТИнвест, Операции);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуНаСервереЗаБольшойПериод()
	
	ИдентификаторСчета = Справочники.Счета.ИдентификаторСчета(Счет);
	
	ПрочитатьГотовыеДанные = Ложь;
	Если ПрочитатьГотовыеДанные Тогда
		ВременноеХранениеДанных = Справочники.ВременноеХранениеДанных.НайтиПоКоду("000000033");
		ДанныеСервиса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВременноеХранениеДанных, "ХранилищеЗначения").Получить();
	Иначе
		ДанныеСервиса = ms_РаботаСREST.TInvest_ПолучитьОперацииПоКурсору(ИдентификаторСчета, Период.ДатаНачала, Период.ДатаОкончания, 10);
		ВременноеХранениеДанных = Справочники.ВременноеХранениеДанных.СоздатьЭлемент();
		ВременноеХранениеДанных.ХранилищеЗначения = Новый ХранилищеЗначения(ДанныеСервиса, Новый СжатиеДанных(9));
		ВременноеХранениеДанных.Записать();
		ОбщегоНазначения.СообщитьПользователю("Записаны данные " + ВременноеХранениеДанных, ВременноеХранениеДанных);
		//Записаны данные 000000001
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСервиса) Тогда
		Операции = ДанныеСервиса;
	КонецЕсли;            
	
	ms_РаботаСREST.TI_ИмпортироватьОперацииПоКурсоруВСделки(Счет, Справочники.ИсточникиДанных.ТИнвест, Операции);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗагрузкуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузку2(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗагрузкуНаСервереЗаБольшойПериод();
	
КонецПроцедуры

&НаСервере
Процедура ФормаПолучитьСписокПозицийПоСчетуНаСервере()
	
	ms_РаботаСREST.ПортфельПоСчету(Счет, , , СоздатьВводОстатков);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПолучитьСписокПозицийПоСчету(Команда)
	ФормаПолучитьСписокПозицийПоСчетуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
  // Код процедур и функций
#КонецОбласти
