
Функция ИдентификаторСчета(Счет) Экспорт

	Если ТипЗнч(Счет) = Тип("СправочникСсылка.Счета") Тогда
		AccountId = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Счет, "AccountId");
		//СчетСсылка = Счет;
	//ИначеЕсли ТипЗнч(Счет) = Тип("Строка") Тогда
	//	AccountId = Счет;
	//	//СчетСсылка = Справочники.Счета.НайтиПоРеквизиту("AccountId", AccountId);
	Иначе
		ВызватьИсключение "Недопустимый тип значения передан в функцию ИдентификаторСчета";
	КонецЕсли;
	
	Возврат AccountId;
	
КонецФункции // ИдентификаторСчета()

