
//&НаКлиенте
//Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
//	//Вставить содержимое обработчика.
//	//ПараметрыФормы = Новый Структура("", );
//	//ОткрытьФорму("Обработка.ЗаполнитьUID_ДляИнструментовБезUID.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
//КонецПроцедуры

//&НаСервере
//Процедура ПолучитьУИДы()

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Инструменты.Ссылка КАК Ссылка, 	Выбор ТипИнструмента когда Перечисление.ТипыИнструментов.Акция Тогда ТипИнструмента = ""INSTRUMENT_TYPE_SHARE""
//	|когда Перечисления.ТипыИнструментов.Облигация Тогда ТипИнструмента = ""INSTRUMENT_TYPE_BOND""
//                                                                                                  |иначе 1/0
//		|	Инструменты.Тикер КАК Тикер,
//		|	Инструменты.Наименование КАК Наименование,
//		|	Инструменты.classCode КАК classCode
//		|ИЗ
//		|	Справочник.Инструменты КАК Инструменты
//		|ГДЕ
//		|	Инструменты.UID = """"";
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		//РаботаСREST.TInvest_ОсновнаяИнформацияОбИнструменте();
//		
//		Данные = РаботаСREST.TInvest_НайтиИнструмент(Выборка.Тикер, Выборка.ТипИнструмента);
//		Если ЗначениеЗаполнено(Данные) и Данные.Свойство("instruments") Тогда
//			Если Данные.instruments.Количество() > 1 Тогда
//				Сообщить(СтрШаблон("По тикеру %1 нашли несколько инструментов, данные не заполнены", Выборка.Тикер));
//				Продолжить;
//			КонецЕсли;
//			ДанныеИнструмента = Данные.instruments[0];
//			//ЗаполнитьРеквизитыИнструментаИзСтруктуры(ДанныеИнструмента);
//			
//			ИнструментОбъект = Выборка.Ссылка.ПолучитьОбъект();
//			ЗаполнитьЗначенияСвойств(ИнструментОбъект, ДанныеИнструмента);
//			ИнструментОбъект.РазмерЛота = ДанныеИнструмента.lot;
//			ИнструментОбъект.Тикер = ДанныеИнструмента.ticker;
//			ИнструментОбъект.Наименование = ДанныеИнструмента.name;
//			Если ДанныеИнструмента.instrumentType = "share" Тогда
//				ИнструментОбъект.ТипИнструмента = Перечисления.ТипыИнструментов.Акция;
//			Иначе
//				Сообщить("нужно дописать заполнение типа инструмента");
//				Продолжить;
//			КонецЕсли;
//			
//			Если ЗначениеЗаполнено(ИнструментОбъект.Тикер) И 
//				ЗначениеЗаполнено(ИнструментОбъект.classCode) И 
//				Не ЗначениеЗаполнено(ИнструментОбъект.ВалютаНоминала) Тогда
//				
//				Данные = РаботаСREST.TInvest_ОсновнаяИнформацияОбИнструменте(ИнструментОбъект.Тикер, ИнструментОбъект.classCode);
//				
//				Если ЗначениеЗаполнено(Данные) и Данные.Свойство("instrument") Тогда
//					ДанныеИнструмента = Данные.instrument;
//					ЗаполнитьЗначенияСвойств(ИнструментОбъект, ДанныеИнструмента);
//					//ИнструментОбъект.РазмерЛота = ДанныеИнструмента.lot;
//					//ИнструментОбъект.Наименование = ДанныеИнструмента.name;
//					ИнструментОбъект.ВалютаНоминала = Справочники.Валюты.НайтиПоНаименованию(ДанныеИнструмента.currency);
//					//Если ДанныеИнструмента.instrumentType = "share" Тогда
//					//	ИнструментОбъект.ТипИнструмента = Перечисления.ТипыИнструментов.Акция;
//					//КонецЕсли;
//				КонецЕсли;

//			КонецЕсли;
//			
//			
//			
//		Иначе
//			ОбщегоНазначения.СообщитьПользователю("Не найден " + Выборка.Тикер);
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


//КонецПроцедуры // ПолучитьУИДы()

