#Область ПрограммныйИнтерфейс

Функция СуммаИзКотировки(Котировка) Экспорт
	
	Если Котировка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	// units приходит строкой
	ЦелаяЧасть = Число(Котировка.units);
	ДробнаяЧасть = Котировка.nano / 1000000000;

	Возврат ЦелаяЧасть + ДробнаяЧасть;

КонецФункции

Функция ПреобразоватьСтрокуВДату(Значение) Экспорт
	
	Если Значение = "1970-01-01T00:00:00" ИЛИ Значение = "1970-01-01T00:00:00Z" Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	Дата = XMLЗначение(Тип("Дата"), Значение);
	Если Год(Дата) = 1970 И Месяц(Дата) = 1 И День(Дата) = 1 Тогда
		Дата = Дата(1, 1, 1);
	КонецЕсли;
	Возврат Дата;

КонецФункции // ПреобразоватьСтрокуВДату()  

Функция ПреобразоватьДатуВСтроку(ДатаЗначение) Экспорт
    
    // Лучше использовать UTC-формат ISO 8601.
    // Подстрой под свой транспортный слой и текущие функции сериализации.
    
    Возврат Формат(ДатаЗначение, "ДФ=yyyy-MM-ddTHH:mm:ss") + "Z";
    
КонецФункции

Функция ПрочитатьЗаписатьВременноеХранениеДанных(Код = "000000001", ПрочитатьГотовыеДанные, ХранилищеЗначения = "?") Экспорт
	
	Возврат Неопределено;
	
	Если ПрочитатьГотовыеДанные Тогда
		ВременноеХранениеДанных = Справочники.ВременноеХранениеДанных.НайтиПоКоду(Код);
		ХранилищеЗначения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВременноеХранениеДанных, "ХранилищеЗначения").Получить();
	Иначе
		ВременноеХранениеДанных = Справочники.ВременноеХранениеДанных.СоздатьЭлемент();
		ВременноеХранениеДанных.ХранилищеЗначения = Новый ХранилищеЗначения(ХранилищеЗначения, Новый СжатиеДанных(9));
		ВременноеХранениеДанных.Записать();
		ОбщегоНазначения.СообщитьПользователю("Записаны данные " + ВременноеХранениеДанных, ВременноеХранениеДанных);
	КонецЕсли;
	
	Возврат ХранилищеЗначения;

КонецФункции // ПрочитатьЗаписатьВременноеХранениеДанных()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
